### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [206]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [207]:
# just looking at the table
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [208]:
#number of unique players
purchase_data['SN'].nunique()

576

In [209]:
#creating a new table with unique players
uniqueplayertable = purchase_data.drop_duplicates(subset=['SN'])
uniqueplayertable.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [210]:
#checking new table for all row counts for all columns
uniqueplayertable.count()

Purchase ID    576
SN             576
Age            576
Gender         576
Item ID        576
Item Name      576
Price          576
dtype: int64

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [211]:
#getting individual values to print in the table below
avgprice=purchase_data["Price"].mean()
avgprice

3.050987179487176

In [212]:
uniqueitems=purchase_data["Item ID"].nunique()
uniqueitems

183

In [213]:
numpurchases=purchase_data["Purchase ID"].count()
numpurchases

780

In [214]:
totalrevenue=purchase_data["Price"].sum()
totalrevenue

2379.77

In [215]:
#displaying the table using the individual values from above
data = {'Number of Unique Items':[uniqueitems], 
        'Average Price':[avgprice], 
        'Number of Purchases':[numpurchases], 
        'Total Revenue':[totalrevenue]} 

df=pd.DataFrame (data)
df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

## Gender Demographics

In [216]:
# used concat function (reference:stack overflow) to combine counts and percentage for groupby Gender
gender=uniqueplayertable['Gender'].value_counts()
genderpercentage=uniqueplayertable['Gender'].value_counts(normalize=True).mul(100).round(2).astype(str) + '%'

df=pd.concat([gender, genderpercentage], axis=1, keys=('counts','percentage'))
#saving this value (uniquegendercounts) for the next section for price per person
uniquegendercounts= df['counts']
df

                       counts percentage
Male                      484     84.03%
Female                     81     14.06%
Other / Non-Disclosed      11      1.91%

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [217]:
# this part was the toughest on getting Price per person as one value is from one table (purchase_data) and the other value is from another table (uniqueplayertable)
#getting individual values and then printing the table 
PurchasingAnalysisMean= purchase_data.groupby('Gender').mean()

PurchasingAnalysisSum= purchase_data.groupby('Gender').sum()

PurchasingAnalysisCount= purchase_data.groupby('Gender').count()

PriceAvg=PurchasingAnalysisMean['Price']

PriceTotal=PurchasingAnalysisSum['Price']

PurchaseCount=PurchasingAnalysisCount['Purchase ID']
PriceperPerson= PriceTotal/uniquegendercounts   # PriceTotal is from 2 lines above and uniquegendercounts is from previous section
data = {'Average Price':PriceAvg, 
        'Total Price':PriceTotal, 
        'Purchase Count':PurchaseCount,
        'Price per Person': PriceperPerson} 

df=pd.DataFrame (data)
df

,Average Price,Total Price,Purchase Count,Price per Person
Gender,,,,
Female,3.203009,361.94,113,4.468395
Male,3.017853,1967.64,652,4.065372
Other / Non-Disclosed,3.346000,50.19,15,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [218]:
#creating bins for age groups and printing doing counts and percentage using concat function
bins=[0, 9, 14, 19, 24, 29, 34, 39, 100]
labels=["0-9", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

df = pd.concat([pd.cut(uniqueplayertable['Age'], bins=bins, labels=labels).value_counts(sort=False), pd.cut(uniqueplayertable['Age'], bins=bins, labels=labels).value_counts(sort=False, normalize=True).mul(100)],axis=1, keys=('counts','percentage'))
#saving this value for the next section for price per person
uniqueagecounts= df['counts']
df

       counts  percentage
0-9        17    2.951389
10-14      22    3.819444
15-19     107   18.576389
20-24     258   44.791667
25-29      77   13.368056
30-34      52    9.027778
35-39      31    5.381944
40+        12    2.083333

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [219]:
#creating individual values and then using the uniqueagecounts from previous section to get price per person and printing table
bins=[0, 9, 14, 19, 24, 29, 34, 39, 100]
labels=["0-9", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]


AgeMean= purchase_data.groupby(pd.cut(purchase_data.Age, bins=bins, labels=labels)).mean()

AgeSum= purchase_data.groupby(pd.cut(purchase_data.Age, bins=bins, labels=labels)).sum()

AgeCount= purchase_data.groupby(pd.cut(purchase_data.Age, bins=bins, labels=labels)).count()

PriceAvg=AgeMean['Price']

PriceTotal=AgeSum['Price']

PurchaseCount=AgeCount['Purchase ID']

AgeperPerson= PriceTotal/uniqueagecounts   
data = {'Average Price':PriceAvg, 
        'Total Price':PriceTotal, 
        'Purchase Count':PurchaseCount,
        'Price per Person': AgeperPerson} 


df=pd.DataFrame (data)

df

       Average Price  Total Price  Purchase Count  Price per Person
Age
0-9         3.353478        77.13              23          4.537059
10-14       2.956429        82.78              28          3.762727
15-19       3.035956       412.89             136          3.858785
20-24       3.052219      1114.06             365          4.318062
25-29       2.900990       293.00             101          3.805195
30-34       2.931507       214.00              73          4.115385
35-39       3.601707       147.67              41          4.763548
40+         2.941538        38.24              13          3.186667

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

topspenders=uniqueplayertable.groupby('SN').aggregate({"Purchase ID":['count'],"Price":['mean','sum']})
#.rename (columns={'count':"Total count", 'mean': "Avg Price", 'sum':"Total price"})
topspenders.max(5)

In [220]:
#getting individual values and using sort_value to display in descending order for total price and then display the table for the top 5 spenders

SNMean= purchase_data.groupby('SN').mean()

SNSum= purchase_data.groupby('SN').sum()

SNCount= purchase_data.groupby('SN').count()

SNPriceAvg=SNMean['Price']

SNPriceTotal=SNSum['Price']

SNPurchaseCount=SNCount['Purchase ID']

data = {'Average Price':SNPriceAvg, 
        'Total Price':SNPriceTotal, 
        'Purchase Count':SNPurchaseCount} 

df=pd.DataFrame (data).reset_index()
descending=df.sort_values('Total Price', ascending=False)
descending.head()

              SN  Average Price  Total Price  Purchase Count
360    Lisosia93       3.792000        18.96               5
246  Idastidru52       3.862500        15.45               4
106   Chamjask73       4.610000        13.83               3
275       Iral74       3.405000        13.62               4
281  Iskadarya95       4.366667        13.10               3

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [221]:
#grouping by Item Name and ID and getting individual values
INMean= purchase_data.groupby(['Item Name', 'Item ID']).mean()

INSum= purchase_data.groupby(['Item Name', 'Item ID']).sum()

INCount= purchase_data.groupby(['Item Name', 'Item ID']).count()

INPriceAvg=INMean['Price']

INPriceTotal=INSum['Price']

INPurchaseCount=INCount['Purchase ID']

data = {'Average Price':INPriceAvg, 
        'Total Price':INPriceTotal, 
        'Purchase Count':INPurchaseCount} 

df=pd.DataFrame (data).reset_index()
# sorting in descending order for purchase count column
descending=df.sort_values('Purchase Count', ascending=False)
descending.head()

,Item Name,Item ID,Average Price,Total Price,Purchase Count
95,"Oathbreaker, Last Hope of the Breaking Storm",178,4.23,50.76,12
52,"Extraction, Quickblade Of Trembling Hands",108,3.53,31.77,9
94,Nirvana,82,4.90,44.10,9
56,Fiery Glass Crusader,145,4.58,41.22,9
108,"Pursuit, Cudgel of Necromancy",19,1.02,8.16,8

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [223]:
#sorting by total purchase value in descending order
descending=df.sort_values('Total Price', ascending=False)
descending.head()

,Item Name,Item ID,Average Price,Total Price,Purchase Count
95,"Oathbreaker, Last Hope of the Breaking Storm",178,4.23,50.76,12
94,Nirvana,82,4.90,44.10,9
56,Fiery Glass Crusader,145,4.58,41.22,9
57,Final Critic,92,4.88,39.04,8
128,Singed Scalpel,103,4.35,34.80,8